#+title: Drafting research papers with Emacs orgmode
#+author: Philip Yang
#+email: phi@cs.umd.edu
#+OPTIONS: texht:t
#+OPTIONS: toc:nil _:nil ^:nil tags:t e:t tasks:nil d:t
#+EXPORT_EXCLUDE_TAGS: noexport

#+LATEX_CLASS: article
# #+LaTeX_CLASS_OPTIONS: [article,letterpaper,11pt,listings-bw,microtype]
#+LaTeX_CLASS_OPTIONS: [palatino,11pt,letterpaper]
#+LATEX_HEADER: \usepackage{mathtools}
#+LaTeX_HEADER: \usepackage[T1]{fontenc} 
#+LaTeX_HEADER: \usepackage[scaled]{beraserif}
#+LaTeX_HEADER: \usepackage[scaled]{berasans} 
#+LaTeX_HEADER: \usepackage[scaled]{beramono}

# All the bibliography settings
#+LaTeX_HEADER: \usepackage[backend=biber]{biblatex}
#+LaTeX_HEADER: \addbibresource{draft_references.bib}
# \bibliography{draft_references}
#+LINK: bib rtcite:draft_references.bib::%s
#+LINK: note rtcite:draft.org::#%s

# Exporting with LaTeX, custom command will be shown 
# in the preview command Ctrl(c-x-l) 
#+LATEX_HEADER: \newcommand{\norm}[1]{\left\| #1 \right\|}
#+LaTeX_HEADER: \newcommand{\expected}[2]{\mathbb{E}_{#1}\left[ #2 \right]}
#+LaTeX_HEADER: \newcommand{\integral}[2]{\int_{\Omega} \! #2 \, \mathrm{d}#1}
#+LaTeX_HEADER: \newcommand{\var}[1]{\mathrm{Var}\left[ #1 \right]}
#+LaTeX_HEADER: \newcommand{\covar}[1]{\mathrm{Cov}\left[ #1 \right]}
#+LaTeX_HEADER: \newcommand{\abs}[1]{\left| #1 \right|}


# Tips:
#   C-c C-x p to add the CUSTOM_ID tag
#   C-c C-x C-l to preview the rendered latex image, C-c C-c to remove image display
#   C-c C-x C-v	org-toggle-inline-images
#   C-c C-x C-i/o clock in and out, for timing of a task
#   C-c C-x C-c/q turn on/off column view (http://orgmode.org/worg/org-tutorials/org-column-view-tutorial.html)

# Online references:
# http://orgmode.org/manual/LaTeX-specific-attributes.html#LaTeX-specific-attributes

#+BEGIN_ABSTRACT
We demonstrate how to write a bibliography-enabled draft. 
This is done with the help of /biblatex/.
#+END_ABSTRACT

* A section with figures and plots
  If the export function fails, it is likely to be caused by this section. 
  Type =C-c ;= here to comment this section, which prevent it from being exported.

  Tables are an inherent feature of =orgmode=. 
  |-----------+-----------+---------|
  | Sede      | Max cites | H-index |
  |-----------+-----------+---------|
  | Chile     |    257.72 |   21.39 |
  | Leeds     |    165.77 |   19.68 |
  | Sao Paolo |     71.00 |   11.50 |
  | Stockholm |    134.19 |   14.33 |
  | Morelia   |    257.56 |   17.67 |
  
  Sometimes we would like to run a quick simulation in =R=
  to illustrate certain principles. 
  #+BEGIN_SRC R :results output org :exports all
    library(ascii)
    a <- runif(100)
    c <- "Quantiles of 100 random numbers"
    b <- ascii(quantile(a),header=T,include.colnames=T,caption=c)
    print(b,type="org")
    rm(a,b,c)
  #+END_SRC
  
  #+RESULTS:
  #+CAPTION: Quantiles of 100 random numbers
  | 0%   | 25%  | 50%  | 75%  | 100% |
  |------+------+------+------+------|
  | 0.00 | 0.21 | 0.45 | 0.69 | 1.00 |
  
  #+attr_latex: width=8cm placement=[htbp]
  #+begin_src R :results output graphics :exports all :file figure/fig_plot.pdf
    library(ggplot2)
    a <- rnorm(100)
    b <- 2*a + rnorm(100)
    df <- data.frame(a, b)
    
    # Scatter plot with regression line
    p <- ggplot(df, aes(x = a, y = b))
    p + geom_smooth(method = "lm", se=TRUE, color="red", formula = y ~ x) +    
        geom_point()    
  #+end_src                                     
  
  #+RESULTS:
  [[file:figure/fig_plot.pdf]]
  
